{
  "ADEPT_NOT_FOUND": "It appears that you have not yet ascended to the esteemed rank of adept within the Cult of the Cryptomancer. Fear not, for the path to enlightenment awaits you. To expedite your initiation, contact your local Cryptomancer administrator and transmit your public wallet address to him. You can find your public wallet address in MetaMask, right below your wallet name. Through this vital act, you shall embark upon a journey towards unlocking the arcane secrets that lie within the Cryptomancer's realm.",
  "CULTIST_FOUND": "Ah, my fellow acolyte, rejoice, for you have already transcended the threshold and found your place among the chosen few within the esteemed ranks of the Cult of the Cryptomancer. The arcane gates have opened wide, granting you access to the cryptic treasures that reside within. Now, wield your Cryptomancer Coins with the confidence of a master, for you possess the power to manifest your desires in the realms of both the tangible and the ethereal. Await patiently, for as the cosmic wheels turn, further instructions shall be bestowed upon you, guiding your journey to even greater heights.",
  "METAMASK_INSTALLED": "Greetings, seeker. It seems you have come well-equipped for the challenges ahead. Please sign the current timestamp in MetaMask with your Polygon wallet. Forged in the fires of the blockchain, your wallet shall serve as a testament to your unwavering dedication and devotion to the Cryptomancer's cause. Do not falter, for this trial shall unlock the doors to a new realm of possibilities, empowering you with the wisdom and power to achieve greatness beyond measure.",
  "METAMASK_NOT_INSTALLED": "Greetings, seeker of arcane knowledge. I sense a strong desire within you to join the ranks of the Cult of the Cryptomancer. However, I see you come ill-prepared. The installation of the MetaMask browser plugin and the creation of a wallet for the Polygon blockchain are essential steps for any aspiring member of the Cult of the Cryptomancer. To acquire and interact with Cryptomancer Coins, you will need to have a MetaMask wallet set up.\n\nTo install MetaMask, follow these steps:\n\nVisit metamask.io and add the extension to your browser.\nOpen Metamask, click \"Get Started,\" and choose \"Create a Wallet.\"\nSet a strong password and write down your seed phrase.\nConfirm your seed phrase to complete the wallet creation process.\nTo connect to the Polygon network, click on the Network dropdown menu and select to add additional networks.\nChoose the Polygon network in the following menu.\n\nOnce your wallet is set up, you are one step closer to joining our ranks. Use your newfound MetaMask powers wisely as you venture further into the mysteries of the Cryptomancer.",
  "SESSION_TIMEOUT": "The sands of time have claimed our session, my intrepid companion. But fear not, for this is merely a temporary setback in our shared quest. Recharge your spirit, gather your strength, and return to the fray when the stars align once more.",
  "SIGNATURE_INVALID": "Your provided signature has been deemed invalid, bringing shame upon your aspirations to the Cult of the Cryptomancer. Reflect, rectify, and return with a worthy attestation.",
  "UNEXPECTED_ERROR": "Unexpected events have derailed our discourse. Take a break, reflect, and return with renewed vigor when ready.",
  "SIGNING_FAILED": "Your attempt at creating a signature has failed. Take a break, regroup, and return when ready to try again.",
  "OUTRO_MESSAGE": "\n\nAs a member of the Cult of the Cryptomancer, you shall receive a free amount of Cryptomancer Coins shortly. If you do not receive our arcane cryptocurrency, please reach out to your local Cryptomancer administrator.\n\nUse the \"Import token\" feature of MetaMask and import Cryptomancer Coins with these configurations:\n\nToken address: 0x2718FaC238360B82638d14AA3C4C09e3f658D869\nToken symbol: CMC\nDecimal places: 18\n\nHarness the might of your Cryptomancer Coins, forging your destiny with each transaction. As a new member, await further instructions, as new realms of possibility beckon."
}